# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'nodenv/nodenv'

# Shell
brew 'fish'                         # User-friendly command-line shell
brew 'fisher'                       # Plugin manager for the Fish shell
brew 'starship'                     # Minimal, blazing-fast, and infinitely customizable prompt

# Binaries
brew 'act'                          # Run your GitHub Actions locally
brew 'bat'                          # Like cat but displays content with syntax highlighting
brew 'broot'                        # A new way to see and navigate directory trees
brew 'delta'                        # A viewer for git and diff output
brew 'dust'                         # An easy way to see where the disk is being used.
brew 'fx'                           # JSON viewer
brew 'fzf'                          # Command-line fuzzy finder written
brew 'gh'                           # GitHub command-line tool
brew 'git-town'                     # High-level command-line interface for Git
brew 'gnupg'                        # Enable PGP-signing commits
brew 'highlight'                    # Convert source code to formatted text with syntax highlighting
brew 'httpie'                       # User-friendly cURL replacement
brew 'jsonpp'                       # Command-line JSON pretty-printer
brew 'k9s'                          # Kubernetes CLI To Manage Your Clusters In Style
brew 'lazydocker'                   # Lazier way to manage everything docker
brew 'lsd'                          # Modern replacement for 'ls'
brew 'mackup'                       # Keep your Mac's application settings in sync
brew 'mas'                          # Mac App Store manager
brew 'nmap'                         # Port scanning utility for large networks
brew 'nodenv'                       # Manage multiple Node.js versions
brew 'nodenv-package-json-engine'   # Activate a nodenv node version from package.json#engines.node field
brew 'onefetch'                     # Git repository summary on your terminal
brew 'pinentry-mac'                 # Prompt to enter a PIN or passphrase for PGP keys
brew 'railway'                      # Develop and deploy code with zero configuration
brew 'speedtest-cli'                # Command-line interface for bandwidth tests
brew 'terminal-notifier'            # Send macOS User Notifications from the command-line
brew 'thefuck'                      # Programatically correct mistyped console commands
brew 'tldr'                         # Simplified and community-driven man pages
brew 'trash'                        # CLI tool that moves files or folders to the trash
brew 'viddy'                        # Modern watch command
brew 'wifi-password'                # Show the current WiFi network password
brew 'yarn'                         # JavaScript package manager

# Apps
cask '1password'                    # Password manager
cask 'aerial'                       # Apple TV-like screen saver
cask 'backblaze'                    # Unlimited Cloud Backup for Your Mac
cask 'calibre'                      # eBook manager
cask 'caption'                      # Takes the effort out of finding and setting up the right subtitles
cask 'clay'                         # Personal CRM
cask 'cyberduck'                    # File transfer client
cask 'cron'                         # Next-generation calendar for professionals and teams
cask 'discord'                      # Easiest way to talk over voice, video, and text
cask 'docker'                       # macOS Docker tools
cask 'exodus'                       # Manage & exchange cryptocurrencies
cask 'figma'                        # Collaborative interface design tool
cask 'gitup'                        # Minimal Git GUI
cask 'google-chrome'                # Web browser
cask 'google-drive'                 # Google Drive client
cask 'gpg-suite-no-mail'            # Allows you to manage your OpenPGP keys
cask 'grammarly-desktop'            # Writing assistance tool
cask 'iina'                         # The modern media player for macOS
cask 'imageoptim'                   # Compress images to load them faster
cask 'iterm2'                       # macOS terminal replacement
cask 'kaleidoscope'                 # diff tool
cask 'kindle'                       # eBook reader
cask 'linear-linear'                # Issue tracker
cask 'messenger'                    # Facebook Messenger
cask 'notion'                       # Documentation tool
cask 'pocket-casts'                 # Listen to podcast
cask 'raycast'                      # Blazingly fast, totally extendable launcher.
cask 'setapp'                       # Large collection of powerful Mac apps available by subscription
cask 'signal'                       # Signal Messenger
cask 'slack'                        # IM for teams
cask 'steam'                        # Game management
cask 'sublime-text'                 # Fast code editor
cask 'superhuman'                   # Email client
cask 'todoist'                      # Task manager
cask 'tor-browser'                  # Privacy browser
cask 'vyprvpn'                      # High quality private VPN
cask 'webstorm'                     # Fully-featured web IDE
cask 'whatsapp'                     # WhatsApp desktop client
cask 'zeplin'                       # Design handoffs
cask 'zoom'                         # Video conferencing

# Quicklook
cask 'qlmarkdown'                   # QuickLook plug-in for Markdown files
cask 'quicklook-json'               # QuickLook plug-in for JSON files
cask 'qlcolorcode'                  # QuickLook plug-in for source code with syntax highlighting
cask 'qlstephen'                    # QuickLook plug-in for text files
cask 'quicklook-csv'                # QuickLook plug-in for CSV files
    
# Fonts
cask 'font-hack-nerd-font'          # A typeface designed for source code patched with Nerd Fonts

# Mac App Store
mas 'Alfread', id: 1521082061       # Helps you to actually read articles
mas 'Amphetamine', id: 937984704    # Keep-awake app
mas 'Parcel', id: 639968404         # Delivery tracking app
mas 'Pocket', id: 568494494         # Save content from everywhere
mas 'Flighty', id: 1358823008       # Pilot-grade flight tracking
mas 'Reeder', id: 1449412482        # RSS reader and read later client in one app.
mas 'iA Writer', id: 775737590      # Simple and essential writing experience